Revit 2027 API
Document.NewGutter Method
Creates a gutter.
Overload List
Name | Description
NewGutter(GutterType, Reference) | Creates a gutter along a reference.
NewGutter(GutterType, ReferenceArray) | Creates a gutter along a reference array.
Top
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace